"""Task 5
Создать в ручную список, содержащий цены (10-20 товаров), например:
[57.8, 46.51, 97, ...]

Вывести на экран эти цены через запятую в одну строку, цена должна отображаться в 
виде <r> руб <kk> коп (например <<5 руб 04 коп>>). Подумать, как из цены получить
рубли и копейки, как доьавить нули, если, например, получилось 7 копеек или 0 копеек
(должно быть 07 коп или щ копеек).

Вывести цены, отсортированные по возврастанию, новый список не создовать (доказать,
что обьект списка после сортирровки остался тот же).

Создать новый список, содержащий те же цены, но отсортированные по убывванию.
Вывести цены пяти самых дорогих товаров. Сможете ли вывести ценеы этих товаров
по возврастанию, написав минимум кода?
"""

goods = [57.8, 46.51, 97, 10, 20.14, 30.18, 40.05, 50.98, 9077, 1]
for good in goods:
    rub = int(good)
    kk = (good - rub) * 100
    print(f'{rub} руб {kk:02.0f} коп')  # 02 - добавить после нулей 2шт,  .0f - округление 0 знаком запятой

goods = [57.8, 46.51, 97, 10, 20.14, 30.18, 40.5, 50.98, 9077, 1]
print(id(goods))
goods.sort()
print(id(goods))
for good in goods:
    rub = (good - rub) * 100
    print(f'{rub} руб {kk:02.0f} коп', end=', ') # 02 - добавить поле нулей 2шт, 0f - округление 0 знаков после запятой

good = [57.8, 46.51, 97, 10, 20.14, 30.18, 40.5, 50.98, 9077, 1, 23.7]
for good in sorted(goods)[::-1][:5]:
    rub = int(good)
    kk = (good -int(good)) * 100
    print(f'{rub} руб {kk:02.0f} коп', end=', ') # 02 - добавить поле нулей 2шт, 0f - округление 0 знаков после запятой

# one line
print([f'{int(good)} руб {(good - int (good)) * 100:02.0f} коп' for good in sorted(goods)[::-1][:5]])