"""Task 4
Дан список, содержаний искажённые данные с должностями и именами сотрудников:
['инжинер-конструктор Игорь', 'главный бугалтер МАРИНА',
'токарь высшего разряда нИКОЛАЙ', 'директор аэлина']

Известно, что имя сотрудника всегда в конце строки. Сформироввать из этих 
имён и вывести на экран фразы вида: 'Привет, Игорь!' Подумать, как получить 
имена сотрудников из элементов списка, как привести их к корректному виду.
Можно ли при этом не создавать новый список?
"""
bad_list = ['инженер-конструкттор Игорь', 'главный бухгалтер МАРИНА',
                'токарь высшего разряда нИКОЛАЙ', 'директор аэлита']
for position in bad_list:
    print('Привет', position.split()[-1].title())
